<!-- -*- mode: markdown; coding: utf-8; fill-column: 60; ispell-dictionary: "english" -*- -->

<meta charset="utf-8"/>
<meta name="viewport" content="width=device-width,initial-scale=1"/>
<link rel="stylesheet" href="style.css">


# EDAF75 - lab 2: Testing the database

As usual we have to tell Jupyter to allow SQL:

In [3]:
%load_ext sql

And then we import our movie database

In [4]:
%sql sqlite:///movies.sqlite

'Connected: @movies.sqlite'

We want to make sure that SQLite3 really checks our foreign
key constraints -- to do that, we run:

In [5]:
%%sql
PRAGMA foreign_keys=ON;

 * sqlite:///movies.sqlite
Done.

[]

Now write SQL code for the following tasks:


+ Show the names of all movies.

In [6]:
%%sql
SELECT *
FROM movies

 * sqlite:///movies.sqlite
Done.

[('tt0111161', 'The Shawshank Redemption', 1994, 142),
 ('tt0068646', 'The Godfather', 1972, 275),
 ('tt0468569', 'The Dark Knight', 2008, 152),
 ('tt0167260', 'The Lord of the Rings: The Return of the King', 2003, 301)]

+ Show the performance dates for one of the movies.

In [7]:
%%sql
SELECT start_date,start_time,th_name, name
FROM shows
LEFT JOIN movies
USING (IMDB_key)
WHERE name = "The Shawshank Redemption"

 * sqlite:///movies.sqlite
Done.

[('2019–02-12', '20:00', 'SF LUND', 'The Shawshank Redemption'),
 ('2019–02-13', '20:00', 'SF LUND', 'The Shawshank Redemption'),
 ('2019–02-13', '20:00', 'SF STOCKHOLM', 'The Shawshank Redemption')]

+ Show all data concerning performances at a given theatere
  on a given date.

In [8]:
%%sql
SELECT *, name as title
FROM theaters
LEFT JOIN shows
USING (th_name)
JOIN movies
USING (IMDB_key)
WHERE th_name = "SF STOCKHOLM"

 * sqlite:///movies.sqlite
Done.

[('SF STOCKHOLM', 300, 'tt0068646', '2019–02-12', '20:00', 'The Godfather', 1972, 275, 'The Godfather'),
 ('SF STOCKHOLM', 300, 'tt0111161', '2019–02-13', '20:00', 'The Shawshank Redemption', 1994, 142, 'The Shawshank Redemption'),
 ('SF STOCKHOLM', 300, 'tt0068646', '2019–02-11', '20:00', 'The Godfather', 1972, 275, 'The Godfather')]

+ List all customers

In [9]:
%%sql
SELECT *
FROM customers

 * sqlite:///movies.sqlite
Done.

[('313d1ba0871373fe3eb29fda1ef2d9cd', 'FABIAN FRANKEL', 'hallojsan'),
 ('648b64ff3eb7560015a923265a527bba', 'SEPEHR TAYARI', 'jamboseli'),
 ('e6a37565b6582487c406ac0c72313c48', 'MARCUS INGEMANSSON', 'DJINGSTRING')]

+ List all tickets

In [10]:
%%sql
SELECT *
FROM tickets

 * sqlite:///movies.sqlite
Done.

[('e65ee431d0839a629a4219aa36e9e41b', 'SF LUND', 'tt0111161', '2019–02-12', '20:00'),
 ('d80fb559f3adc366874f6082dd72d0e1', 'SF LUND', 'tt0111161', '2019–02-13', '20:00'),
 ('6c7c505f6bd682d84d96f16182fb4578', 'SF LUND', 'tt0068646', '2019–02-11', '20:00'),
 ('e21e6e0b5bb03f4e876c47868649a423', 'SF MALMO', 'tt0468569', '2019–02-13', '20:00'),
 ('f6413cbcd999ee21b4cdd86b58470f46', 'SF MALMO', 'tt0068646', '2019–02-11', '20:00'),
 ('bd967892c99ac79eebd3a403aa62af5b', 'SF STOCKHOLM', 'tt0068646', '2019–02-12', '20:00'),
 ('af224fd9cdabe28e5c3b4cd8bd076765', 'SF STOCKHOLM', 'tt0111161', '2019–02-13', '20:00'),
 ('0c98fafbf9a279412503fc109ab2ee45', 'SF STOCKHOLM', 'tt0068646', '2019–02-11', '20:00')]

+ Create a new ticket to some performance (i.e., insert a
  new row in your table of tickets).

In [11]:
%%sql
INSERT
INTO tickets (th_name, IMDB_key, start_time, start_date)
VALUES ("SF LUND", "tt0111161", "20:00", "2019–02-12")

 * sqlite:///movies.sqlite
1 rows affected.

[]

In
  [PostgreSQL](https://www.postgresql.org/docs/current/sql-insert.html)
  we can get any value generated during an insert using the
  `INSERT...-RETURNING` statement:

~~~{.sql}
INSERT
INTO       students
VALUES     ('Amy', 3.9, 1200)
RETURNING  s_id
~~~

In SQLite3 (as of January 2020), we can't do that, instead
  we can use the following idea: each row in a SQLite3 table
  has a `rowid` attribute, it is a unique integer which
  essentially tells in which order the rows were inserted,
  and it's not displayed in queries unless we ask for it.
  SQLite3 also have a function, `last_insert_rowid()`, which
  returns the `rowid` of the last inserted row of a table,
  so we can see the `s_id` of the most recently inserted
  student with the following query:

~~~{.sql}
SELECT s_id
FROM   students
WHERE  rowid = last_insert_rowid();
~~~

Now, check what ticket number we got for the ticket we
  created above (it should be the same as the ticket id,
  which should be a `randomblob`):

In [12]:
%%sql
SELECT ticket_id
FROM tickets
WHERE rowid = last_insert_rowid()

 * sqlite:///movies.sqlite
Done.

[('14649add11110e89fb672929387d0fa9',)]

+ Try to insert two movie theaters with the same name (this
  should fail).

In [ ]:
%%sql
INSERT
INTO movies
VALUES ("tt0468569", "The Dark Knight", 2008, 152
);

+ Try to insert a performance where the theater doesn’t
  exist in the database (this should fail).

In [ ]:
%%sql

+ Create a ticket where either the user or the performance
  doesn’t exist.

In [ ]:
%%sql